src/InformationRegisters/ДействиеСкидокНаценок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДействиеСкидокНаценок</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата начала</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Comment>Дата окончания</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПрименений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПримененийПоКлиенту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Comment>Клиника</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкидкаНаценка</Name>
					<Comment>Скидка наценка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкидкиНаценки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ДействиеСкидокНаценок/Ext/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Получить параметры действия скидок/наценок 
Функция ПолучитьПарамтерыДействияСкидки(СкидкаНаценка, СтруктурнаяЕдиница = Неопределено) Экспорт	
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДействиеСкидокНаценокСрезПоследних.СтруктурнаяЕдиница,
	|	ДействиеСкидокНаценокСрезПоследних.ДатаНачала,
	|	ДействиеСкидокНаценокСрезПоследних.ДатаОкончания,
	|	ДействиеСкидокНаценокСрезПоследних.СкидкаНаценка.ТипПолучателя КАК ТипПолучателя,
	|	ДействиеСкидокНаценокСрезПоследних.КоличествоПрименений,
	|	ДействиеСкидокНаценокСрезПоследних.КоличествоПримененийПоКлиенту
	|ИЗ
	|	РегистрСведений.ДействиеСкидокНаценок.СрезПоследних(
	|			,
	|			СкидкаНаценка = &СкидкаНаценка
	|				И ВЫБОР
	|					КОГДА НЕ &СтруктурнаяЕдиница = НЕОПРЕДЕЛЕНО
	|						ТОГДА СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ДействиеСкидокНаценокСрезПоследних");
	
	Запрос.УстановитьПараметр("СкидкаНаценка"      , СкидкаНаценка);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница" , СтруктурнаяЕдиница);

	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции

#КонецОбласти
